docs: change ASCII diagram to Mermaid
